package com.kh.variable;

public class Variable {
	
	public void printNumber() {
		int num = 8;
		// [=] 이거는 대입연산자임. [=] 기준으로 왼쪽의 공간에 오른쪽(정수 실수 문자)을 넣겠다
		System.out.println(num);
	}
		/*변수 사용법 1. 변수선언 ex) int              num
		 *						자료형(DataType)  변수식별자(변수이름)
		*/
		int num;
		/* -이름 지을 때 주의사항-
		 	먼저, 식별자(Identifier)란?
		 		클래스명, 메소드명, 변수명등 개발자가 만들어서 이용하는 이름
		 	------------------------------------------------------------------------
		 	식별자 명명 규칙
		 		1-1 keyword(예약어)는 식별자로 안됨.
		 		1-2 공백문자(띄어쓰기등) 포함할 수 없음.
		 		1-3 숫자를 포함할 수 있으나 숫자로 '시작'은 안됨. ex)babo01 가능, 01babo 불가
		 		1-4 특수문자[$], [_]제외하고 다 안됨.
		 		1-5 대소문자 구분 철저히 할 것.
		 		1-6 길이제한이 없다.
		 	-----------------------------------------------------------------------	
		 	암묵적인 약속 (클래스 / 인터페이스 명명규칙)
		 		3-1 첫 글자는 반드시 '대문자'.
		 		3-2	연결된 단어들의 첫 글자도 대문자로 표기.
		 		3-3 명사, 형용사를 연결해서 사용.
		 	-----------------------------------------------------------------------
		 	변수 명명 규칙
		 		1-1 명사적 의미를 갖게 만들어줌
		 		1-2 첫 글자를 소문자로 표기. 연결된 단어들의 첫 글자는 대문자로 표기. ex)phoneNumber
		 	-----------------------------------------------------------------------
		 	메소드 명명 규칙
		 		1-1 동사적 의미를 갖게 만들어줌. ex)signUp(), signIn(), join()
		 		1-2 메소드 식별자의 경우 식별자 뒤에 반드시 한 쌍의 () 를 붙임.
		 		1-2 메소드 식별자에는 [_] 사용하지 않음.
		 	------------------------------------------------------------------------
		 	상수 명명 규칙
		 		1-1 모든 문자를 대문자로 표기. ex) WELCOME_TO_JAVA_WORLD, LOGIN_OK
		 		1-2 
		 */	
}
